Repository: openedx/xblock-lti-consumer
Catalog: lti_consumer/translations/*/LC_MESSAGES/text.po
Languages: ar, es_419, he

source: Missing LTI 1.3 authentication token.
es_419: El token de autenticación de LTI 1.3 no se encuentra disponible.

source: Invalid token header. No credentials provided.
es_419: Encabezado de token inválido. No se suministraron las credenciales.

source: Invalid token header. Token string should not contain spaces.
es_419: Encabezado de token inválido. La cadena de caracteres del token no debe contener espacios.

source: LTI configuration not found.
es_419: No se encontró la configuración LTI.

source: Invalid token signature.
es_419: Firma de token inválida.

source: No valid user id found in endpoint URL
ar: لم يتم العثور على هوية صالحة للمستخدم في URL نقطة النهاية
es_419: No se encontró un id de usuario válido en el URL del endpoint
he: לא נמצא מזהה משתמש תקף בכתובת ה-URL הסופית

source: Display Name
ar: عرض الاسم
es_419: Nombre a mostrar
he: הצג שם

source: Enter the name that students see for this component. Analytics reports may also use the display name to identify this component.
ar: أدخل الاسم الذي يراه الطلاب لهذا المكون. يمكن أن تستخدم تقارير التحليلات أيضاً الاسم المعروض من أجل تعريف هذا المكون.
es_419: Ingrese el nombre que los estudiantes verán para este componente. Los reportes de Analytics también pueden utilizar el nombre para mostrar para identificar este componente.
he: יש להזין את שם המרכיב שרואים הלומדים. דוחות הניתוח יכולים להשתמש גם בשם התצוגה לזיהוי מרכיב זה.

source: LTI Consumer
ar: مستخدم LTI
es_419: Consumidor LTI
he: צרכן LTI

source: LTI Application Information
ar: معلومات تطبيق LTI
es_419: Información sobre la aplicación LTI
he: מידע אודות אפליקציית LTI

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
ar: قم بإدخال وصف لتطبيق الطرف الثالث. إذا تم طلب اسم مستخدم و/أو بريد إلكتروني، استخدم مربع النص هذا لإبلاغ المستخدمين عن سبب تحويل اسم المستخدم و/أو البريد الإلكتروني الخاص بهم إلى تطبيق طرف ثالث.
es_419: Provea una descripción de la aplicación de un tercero. Si se solicita el nombre del usuario o su correo, use este cuadro de texto para informar al usuario que su nombre de usuario y su correo serán redireccionados a una aplicación de un tercero.
he: יש להזין תיאור של יישום צד ג'. בבקשת שם משתמש ו/או כתובת דוא״ל, יש להשתמש בתיבת טקסט זו על מנת להודיע למשתמשים מדוע שם המשתמש ו/או כתובת הדוא״ ל שלהם תועבר ליישום של גורם צד ג'.

source: LTI Version
es_419: Versión LTI

source: Select the LTI version that your tool supports.<br />The XBlock LTI Consumer fully supports LTI 1.1.1, LTI 1.3 and LTI Advantage features.
es_419: Seleccione la versión de LTI que su herramienta soporta. <br />El Xblock LTI Consumer soporta completamente las características de LTI 1.1.1, LTI 1.3 y LTI Advantage.

source: Tool Launch URL
es_419: URL para lanzar la herramienta

source: Enter the LTI 1.3 Tool Launch URL. <br />This is the URL the LMS will use to launch the LTI Tool.
es_419: Ingrese la URL para lanzar la herramienta LTI 1.3. <br />Esta es la URL que el LMS usará para abrir la herramienta LTI.

source: Tool Initiate Login URL
es_419: URL para iniciar el login en la herramienta externa

source: Enter the LTI 1.3 Tool OIDC Authorization url (can also be called login or login initiation URL).<br />This is the URL the LMS will use to start a LTI authorization prior to doing the launch request.
es_419: Ingrese la URL de autorización OIDC de la herramienta LTI 1.3 (tambien llamada URL de login, o de inicio de sesión). <br />Esta es la URL que el LMS usará para iniciar la autorización con el componente LTI antes de comenzar.

source: Tool Public Key Mode
es_419: Modo de clave pública de la herramienta

source: Select how the tool's public key information will be specified.
es_419: Seleccione cómo se especificará la información de la clave pública de la herramienta.

source: Tool Keyset URL
es_419: URL del conjunto de claves de la herramienta

source: Enter the LTI 1.3 Tool's JWK keysets URL.<br />This link should retrieve a JSON file containing public keys and signature algorithm information, so that the LMS can check if the messages and launch requests received have the signature from the tool.<br /><b>This is not required when doing LTI 1.3 Launches without LTI Advantage nor Basic Outcomes requests.</b>
es_419: Ingrese la clave pública de la herramienta LTI 1.3.<br />Esta cadena de texto comienza con '-----BEGIN PUBLIC KEY-----' y es requerida por el LMS para verificar los mensajes recibidos desde la herramienta externa.<br /><b>No es requerida cuando se hace el lanzamiento de la herramienta sin LTI Advantage ni para peticiones sencillas.</b>

source: Tool Public Key
es_419: Llave pública de la herramienta

source: Enter the LTI 1.3 Tool's public key.<br />This is a string that starts with '-----BEGIN PUBLIC KEY-----' and is required so that the LMS can check if the messages and launch requests received have the signature from the tool.<br /><b>This is not required when doing LTI 1.3 Launches without LTI Advantage nor Basic Outcomes requests.</b>
es_419: Ingrese la llave pública de la herramienta LTI 1.3.<br />Esta cadena de texto comienza con '-----BEGIN PUBLIC KEY-----' y es requerida por el LMS para verificar los mensajes recibidos desde la herramienta externa.<br /><b>No es requerida cuando se hace el lanzamiento de la herramienta sin LTI Advantage ni para peticiones sencillas.</b>

source: Enable LTI NRPS
es_419: Habilitar LTI NRPS

source: Enable LTI Names and Role Provisioning Services.
es_419: Habilitar los servicios de provisión de nombres y roles de LTI.

source: LTI 1.3 Block Client ID - DEPRECATED
es_419: LTI 1.3 Block Client ID - DEPRECADO

source: DEPRECATED - This is now stored in the LtiConfiguration model.
es_419: DEPRECADO - Esto ahora se almacena en el modelo LtiConfiguration.

source: LTI 1.3 Block Key - DEPRECATED
es_419: LTI 1.3 Block Key - DEPRECADO

source: Select True if you want to enable LTI Advantage Deep Linking.
es_419: Seleccione True si desea habiliitar el Deep Linking de LTI Advantage.

source: Deep Linking Launch URL
es_419: URL de lanzamiento para Deep Linking

source: Enter the LTI Advantage Deep Linking Launch URL. If the tool does not specify one, use the same value as 'Tool Launch URL'.
es_419: Ingrese la URL de lanzamiento para LTI Advantage Deep Linking. Si la herramienta no especifica una dirección, use la misma dirección URL para lanzamiento de la herramienta.

source: LTI Assignment and Grades Service
es_419: Servicio de Tareas y Calificaciones de LTI

source: Disabled
es_419: Invalidar

source: Allow tools to submit grades only (declarative)
es_419: Permite que las herramientas envíen únicamente calificaciones (declarativo)

source: Allow tools to manage and submit grade (programmatic)
es_419: Permite que las herramientas envíen calificaciones (programático)

source: Enable the LTI-AGS service and select the functionality enabled for LTI tools. The 'declarative' mode (default) will provide a tool with a LineItem created from the XBlock settings, while the 'programmatic' one will allow tools to manage, create and link the grades.
es_419: Habilite el servicio AGS de LTI y seleccione la funcionalidad habilitada para las herramientas LTI. El modo 'declarativo' (por defecto) le dará una herramienta con un LineItem creado a partir de las configuraciones del Xblock, mientras el modo 'programático' le permitirá a las herramientas administrar, crear y enlazar las calificaciones.

source: LTI ID
ar: هوية LTI
es_419: ID de LTI
he: מזהה LTI

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See the {docs_anchor_open}edX LTI documentation{anchor_close} for more details on this setting.
ar: أدخل هوية LTI لمورد LTI الخارجي. يجب أن تكون هذه القيمة هي نفس قيمة هوية LTI التي أدخلتها في إعدادات جوازات مرور LTI في صفحة الإعدادات المتقدمة.<br />اطلع على مستندات {docs_anchor_open} edX LTI{anchor_close} للمزيد من التفاصيل عن هذا الإعداد.
es_419: Introduzca el ID LTI para el proveedor LTI externo. Este valor debe ser el mismo ID LTI que ingresó en la configuración de Pasaportes LTI en la página Configuración avanzada.<br />Consulte la {docs_anchor_open} documentación de edX LTI {anchor_close} para obtener más detalles sobre esta configuración.
he: הזן את מזהה ה-LTI לספק ה-LTI החיצוני. ערך זה חייב להיות זהה למזהה LTI שהזנת בהגדרות LTI Passports הנמצא בעמוד ההגדרות המתקדמות.<br />לפרטים נוספים אודות הגדרה זו, ראה {docs_anchor_open}edX LTI תיעוד{anchor_close}.

source: LTI URL
es_419: URL de LTI
he: כתובת ה-URL של LTI

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See the {docs_anchor_open}edX LTI documentation{anchor_close} for more details on this setting.
ar: أدخل URL الأداة الخارجية التي يقوم هذا المكون بتشغيلها. يتم استخدام هذا الإعداد فقط عند تحديد إخفاء الأداة الخارجية على خيار خاطئ.<br />اطلع على مستندات {docs_anchor_open} edX LTI{anchor_close} للمزيد من التفاصيل عن هذا الإعداد.
es_419: Ingrese la URL de la herramienta externa que este componente inicia. Esta configuración sólo se utiliza cuando Ocultar herramienta externa se establece en Falso.<br />Consulte la {docs_anchor_open} documentación de edX LTI {anchor_close} para obtener más detalles sobre esta configuración.
he: הזן את כתובת האתר של הכלי החיצוני שרכיב זה מפעיל. ניתן להשתמש בהגדרה זו אך ורק כאשר האפשרות 'הסתר כלי חיצוני' נמצאת במצב 'False'.<br />לפרטים נוספים אודות הגדרה זו, ראה {docs_anchor_open}edX LTI תיעוד{anchor_close}.

source: Custom Parameters
ar: العوامل المخصصة
es_419: Parámetros personalizados
he: פרמטרים מותאמים אישית

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component. Ex. ["page=1", "color=white"]<br />See the {docs_anchor_open}edX LTI documentation{anchor_close} for more details on this setting.
ar: أضف زوج المفتاح/القيمة لأي عوامل مخصصة، مثل الصفحة التي يجب أن يفتحها كتابك الإلكتروني أو لون خلفية هذا المكون. مثال. Ex. ["page=1", "color=white"]<br />اطلع على مستندات {docs_anchor_open} edX LTI{anchor_close} للمزيد من التفاصيل عن هذا الإعداد.
es_419: Agregue el par clave / valor para cualquier parámetro personalizado, como la página a la que su libro electrónico debe abrirse o el color de fondo para este componente. Ej. ["page=1", "color=white"]<br />Consulte la {docs_anchor_open} documentación de edX LTI {anchor_close} para obtener más detalles sobre esta configuración
he: הוסף את צמד מפתח/ערך לכל פרמטר בהתאמה אישית כמו הדף שבו הספר האלקטרוני צריך להיפתח או צבע הרקע של מרכיב זה. לדוגמה. ["page=1", "color=white"]<br />ראה את {docs_anchor_open}edX LTI תיעוד{anchor_close} לפרטים נוספים אודות הגדרה זו.

source: LTI Launch Target
ar: هدف تشغيل LTI
es_419: Target para el LTI
he: יעד השקת LTI

source: Select Inline if you want the LTI content to open in an IFrame in the current page. Select Modal if you want the LTI content to open in a modal window in the current page. Select New Window if you want the LTI content to open in a new browser window. This setting is only used when Hide External Tool is set to False.
ar: قم بتحديد خط داخلي إذا كنت تريد أن يتم فتح محتويات LTI في إطار IFrame في الصفحة الحالية. حدد الشكل إذا كنت تريد أن يتم فتح محتويات LTI في نافذة موضعية في الصفحة الحالية. اختر نافذة جديدة إذا كنت تريد أن يتم فتح محتويات LTI في نافذة متصفح جديد. ‏‫سيتم استخدام هذا الإعداد فقط عندما يتم ضبط إخفاء الأداة الخارجية على خاطىء .
es_419: Seleccione Inline si desea que el contenido LTI se abra en un IFrame en la página actual. Seleccione Modal si desea que el contenido LTI se abra en una ventana modal en la página actual. Seleccione Nueva ventana si desea que el contenido LTI se abra en una nueva ventana del navegador. Esta configuración sólo se utiliza cuando Ocultar herramienta externa se establece en Falso.
he: בחר את האפשרות Inline אם ברצונך שתוכן ה-LTI יפתח בעמוד הנוכחי ב- IFrame. בחר את האפשרות Modal אם ברצונך שתוכן ה-LTI יפתח בעמוד הנוכחי בחלון Modal. בחר את האפשרות New Window אם ברצונך שתוכן ה-LTI יפתח בחלון דפדפן חדש. ניתן להשתמש בהגדרה זו אך ורק כאשר האפשרות 'הסתר כלי חיצוני' נמצאת במצב 'לא נכון'.

source: Button Text
ar: نص الزر
es_419: Texto para el botón
he: טקסט תחתי

source: Enter the text on the button used to launch the third party application. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal or New Window.
ar: أدخل النص على الزر المستخدم لبدء تشغيل تطبيق الطرف الثالث. لا يتم استخدام هذا الإعداد إلا عند ضبط إخفاء الأداة الخارجية على خاطئ، وضبط هدف بدء تشغيل LTI على نموذج أو نافذة جديدة .
es_419: Ingrese el texto en el botón usado para iniciar la aplicación de terceros. Esta opción sólo se utiliza cuando Ocultar herramienta externa se establece en Falso y el Target para el LTI se establece en Modal o Nueva Ventana.
he: הזן בתחתית את הטקסט המשמש להפעלת האפליקציה של צד שלישי. ניתן להשתמש בהגדרה זו אך ורק כאשר האפשרות 'הסתר כלי חיצוני' נמצאת במצב 'לא נכון' וכאשר LTI Launch Target מוגדר כ-Modal או חלון חדש.

source: Inline Height
ar: ارتفاع ضمن الخطوط
es_419: Altura Inline
he: גובה ה-inline

source: Enter the desired pixel height of the iframe which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Inline.
ar: أدخل ارتفاع البيكسل المرغوب لإطار iframe الذي سوف يحتوي على أداة LTI. لا يتم استخدام هذا الإعداد إلا عند ضبط إخفاء الأداة الخارجية على خاطئ، وضبط هدف بدء تشغيل LTI ضمن الخطوط.
es_419: Introduzca la altura en píxeles deseada del iframe que contendrá la herramienta LTI. Esta opción sólo se utiliza cuando Ocultar herramienta externa se establece en False y Target para el LTI se establece en Inline.
he: הזן את גובה הפיקסלים המבוקש של ה-iframe שיכלול את כלי ה-LTI. ניתן להשתמש בהגדרה זו אך ורק כאשר האפשרות 'הסתר כלי חיצוני' נמצאת במצב 'לא נכון' וכאשר LTI Launch Target מוגדר כ-Inline.

source: Modal Height
ar: ارتفاع شكلي
es_419: Altura del modal
he: גובה ה-Modal

source: Enter the desired viewport percentage height of the modal overlay which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal.
ar: أدخل الارتفاع المرغوب لمنفذ العرض بالنسبة المئوية للتداخل الشكلي الذي سوف يحتوي على أداة LTI. لا يتم استخدام هذا الإعداد إلا عند ضبط إخفاء الأداة الخارجية على خاطئ، وضبط هدف بدء تشغيل LTI على نموذج.
es_419: Ingrese la altura de porcentaje de visualización deseada de la superposición modal que contendrá la herramienta LTI. Esta opción sólo se utiliza cuando Ocultar herramienta externa se establece en False y Target para el LTI se establece en Modal.
he: הזן את אחוז גובה האשנב של כיסוי ה-modal שיכלול את כלי ה-LTI. ניתן להשתמש בהגדרה זו אך ורק כאשר האפשרות 'הסתר כלי חיצוני' נמצאת במצב 'לא נכון' וכאשר LTI Launch Target מוגדר כ-Modal.

source: Modal Width
ar: العرض الشكلي
es_419: Ancho del modal
he: רוחב ה-Modal

source: Enter the desired viewport percentage width of the modal overlay which will contain the LTI tool. This setting is only used when Hide External Tool is set to False and LTI Launch Target is set to Modal.
ar: أدخل العرض المرغوب لمنفذ العرض بالنسبة المئوية للتداخل الشكلي الذي سوف يحتوي على أداة LTI. لا يتم استخدام هذا الإعداد إلا عند ضبط إخفاء الأداة الخارجية على خاطئ، وضبط هدف بدء تشغيل LTI على نموذج.
es_419: Ingrese el ancho de porcentaje de la ventana de visualización de la superposición modal que contendrá la herramienta LTI. Esta opción sólo se utiliza cuando Ocultar herramienta externa se establece en False y Target para el LTI se establece en Modal.
he: הזן את אחוז רוחב האשנב של כיסוי ה-modal שיכלול את כלי ה-LTI. ניתן להשתמש בהגדרה זו אך ורק כאשר האפשרות 'הסתר כלי חיצוני' נמצאת במצב 'לא נכון' וכאשר LTI Launch Target מוגדר כ-Modal.

source: Scored
ar: النتيجة
es_419: Puntuado
he: קיבל ציון

source: Select True if this component will receive a numerical score from the external LTI system.
ar: اختر صحيح إذا كان هذا المكون سيحصل على نتيجة رقمية من نظام LTI خارجي.
es_419: Seleccione True si este componente recibirá una puntuación numérica desde un sistema LTI externo.
he: בחר באפשרות נכון אם מרכיב זה יקבל ציון מספרי ממערכת ה-LTI החיצונית.

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
ar: أدخل عدد النقاط المتاحة لهذا المكون. القيمة الافتراضية هي 1.0. ‏‫يتم استخدام هذا الإعداد فقط عند تحديد النتيجة المنشورة صحيح.
es_419: Ingrese el número de puntos posibles para este componente. El valor por defecto es 1.0. Este valor solo se utiliza cuando el parámetro de calificación está definido como True.
he: הזן את מספר הנקודות האפשריות למרכיב זה. ברירת המחדל היא 1.0. ניתן להשתמש בהגדרה זו אך ורק כאשר 'קיבל ציון' מוגדר כ-נכון.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
ar: النتيجة المحفوظة في xblock KVS -- هي نسخة عن النتيجة المنشورة في django DB
es_419: La calificación almacenada en xblock KVS -- un duplicado de la calificación publicada en django DB
he: הציון נשמר ב- xblock KVS – שכפול הציון המפורסם ב-django DB

source: Comment as returned from grader, LTI2.0 spec
ar: الملاحظات التي تم إرجاعها من مانح العلامة، مواصفات LTI2.0
es_419: El comentario tal y como fue enviado por el evaluador, LTI2.0 spec
he: הערה חוזרת ממעניק הציון, LTI2.0 spec

source: Hide External Tool
ar: إخفاء الأداء الخارجية
es_419: Ocultar la herramienta externa
he: הסתר כלי חיצוני

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
ar: اختر صحيح إذا كنت ترغب في استخدام هذا المكون كحافظ للمكان للمزامنة مع نظام خارجي لوضع العلامات بدلاً نت استخدام أداة خارجية. يقوم هذا الإعداد بإخفاء زر بدء التشغيل وأي IFrames لهذا المكون.
es_419: Seleccione True si desea usar este componente como marcador para sincronizarse con un servicio externo en lugar de lanzar una herramienta externa. Esta opción oculta el botón de Lanzar y cualquier iframe para este componente.
he: בחר באפשרות 'נכון' אם ברצונך להשתמש במרכיב זה כשומר מקום עבור סנכרון עם מערכת ציונים חיצונית במקום להפעיל כלי חיצוני. הגדרה זו מסתירה את לחצן 'הפעל' וכל IFrames עבור מרכיב זה.

source: Accept grades past deadline
ar: قبول العلامات بعد انقضاء الموعد المحدد
es_419: Aceptar notas después de la fecha límite
he: קבל ציונים לאחר המועד הסופי

source: Select True to allow third party systems to post grades past the deadline.
ar: اختر صحيح للسماح لأنظمة الطرف الثالث بوضع علامات بعد انقضاء الموعد المحدد.
es_419: Seleccione True para permitir que sistemas de terceros publiquen calificaciones después de la fecha límite.
he: בחר באפשרות 'נכון' על מנת לאפשר למערכות צד שלישי לפרסם ציונים לאחר המועד הסופי.

source: Request user's username
ar: اطلب اسم المستخدم الخاص بالمستخدم
es_419: Solicite el nombre público del usuario
he: בקש את שם המשתמש של המשתמש

source: Select True to request the user's username.
ar: اختر ״ صحيح״ لطلب اسم مستخدم خاص بالمستخدم.
es_419: Seleccione True para solicitar el nombre de usuario.
he: בחר באפשרות 'נכון' על מנת לבקש את שם המשתמש של המשתמש.

source: Request user's email
ar: اطلب البريد الإلكتروني الخاص بالمستخدم
es_419: Solicitar la dirección de correo del usuario
he: בקש את כתובת הדוא״ל של המשתמש

source: Select True to request the user's email address.
ar: اختر صحيح لطلب عنوان البريد الإلكتروني الخاص بالمستخدم.
es_419: Seleccione True para solicitar el correo electrónico del usuario.
he: בחר באפשרות 'נכון' על מנת לבקש את כתובת דוא״ל המשתמש.

source: Send extra parameters
es_419: Enviar parámetros adicionales

source: Select True to send the extra parameters, which might contain Personally Identifiable Information. The processors are site-wide, please consult the site administrator if you have any questions.
es_419: Seleccione True praa enviar los parámetros adicionales, los cuales pueden contener información de identificación personal. Los procesadores son para todo el sitio, por favor consulte al administrador del sitio si tiene cualquier pregunta.

source: Custom Parameters must be a list
es_419: Los parámetros personalizados deben ser una lista

source: Could not parse LTI passport: {lti_passport!r}. Should be "id:key:secret" string.
es_419: No fué posible parsear el pasaporte LTI: {lti_passport!r}. Debería ser una cadena de tipo "id:key:secret".

source: Could not get user id for current request
ar: تعذر الحصول على هوية مستخدم للطلب الحالي
es_419: No se pudo obtener el id de usuario para esta petición
he: לא ניתן להשיג מזהה משתמש לבקשה הנוכחית

source: Could not parse custom parameter: {custom_parameter!r}. Should be "x=y" string.
es_419: No fué posible parsear el parametro: {custom_parameter!r}. Debería ser una cadena tipo "x=y".

source: [LTI]: Real user not found against anon_id: {}
ar: [LTI]: لم يتم العثور على مستخدم حقيقي مقابل هوية غير معرفة: {}
es_419: [LTI]: No se encontró un usuario que coincidiera con anon_id: {}
he: [LTI]: לא נמצא משתמש אמיתי מול anon_id: {}

source: Configuration Stored on XBlock fields
es_419: Configuración almacenada en campos de XBlocks

source: Configuration Stored on this model
es_419: Configuración almacenada en este modelo

source: LTI configuration data.
es_419: Datos de configuración de LTI

source: The URL of the external tool that initiates the launch.
es_419: URL de la herramienta externa que inicia el lanzamiento.

source: Client key provided by the LTI tool provider.
es_419: Llave de cliente suministrada por el proveedor de la herramienta LTI.

source: Client secret provided by the LTI tool provider.
es_419: Secreto de cliente suministrado por el proveedor de la herramienta LTI.

source: Platform's generated Private key. Keep this value secret.
es_419: Llave privada generada para la plataforma. Mantenga este valor en secreto.

source: Platform's generated Private key ID
es_419: Llave privada generada para la plataforma.

source: Platform's generated JWK keyset.
es_419: JWK keyset generado para la plataforma

source: Client ID used by LTI tool
es_419: ID del cliente usado por la herramienta LTI

source: LTI Configuration stores on XBlock needs a block location set.
es_419: Las configuraciones LTI para XBlock necesitan una ubicación de bloque.

source: Invalid LTI configuration.
es_419: Configuración LTI inválida

source: The selected content type is not supported by Open edX.
es_419: El tipo de contenido seleccionado no está soportado por Open edX.

source: You don't have access to save LTI Content Items.
es_419: Usted no tiene acceso para guardar items de contenido LTI.

source: Please check that you have course staff permissions and double check this block's LTI settings.
es_419: Por favor verifique que tiene permisos de staff en el curso y confirme las configuraciones de LTI para este bloque.

source: LTI Deep Linking failed.
es_419: Falló el Deep Linking de LTI

source: LTI Deep Linking
es_419: Deep Linking de LTI

source: The LTI Deep Linking content was successfully saved in the LMS.
es_419: El contenido de Deep Linking de LTI fué guardado con exito en el LMS.

source: You can safely close this page now.
es_419: Puede cerrar esta página ahora.

source: Unauthorized.
es_419: No autorizado.

source: Students don't have permissions to perform LTI Deep Linking configuration launches.
es_419: Los estudiantes no tienen permisos para lanzar configuraciones de LTI Deep Linking.

source: LTI 1.3 Launches can only be performed from the LMS.
es_419: Los lanzamientos de LTI 1.3 solo pueden ser realizados desde el LMS.
