Repository: openedx/xblock-lti-consumer
Catalog: lti_consumer/translations/*/LC_MESSAGES/text.po
Languages: ar, es_419, he

source: To set up the LTI integration, you need to register the LMS in the tool with the information provided below.
es_419: Para configurar la integración LTI, debe registrar al LMS en la herramienta externa con la información suministrada a continuación.

source: Client ID:
es_419: ID de cliente:

source: Deployment ID:
es_419: ID del deployment:

source: Keyset URL:
es_419: URL del Keyset:

source: Access Token URL:
es_419: URL del token de acceso:

source: Login URL:
es_419: URL de inicio de sesión:

source: Deep Linking is configured on this tool.
es_419: Deep Linking está configurado para esta herramienta.

source: The Deep Linking configuration stored is presented below:
es_419: La configuración guardada de Deep Linking se presenta a continuación:

source: If you run deep linking again, the content above will be replaced.
es_419: Si ejecuta Deep Linking nuevamente, todo el contenido de arriba será reemplazado.

source: You can configure this tool's content using LTI Deep Linking.
es_419: Puede configurar el contenido de esta herramienta usando LTI deep linking

source: To do that, make sure the block is published and click the link below:
es_419: Para hacer esto, asegurese de que el bloque esté publicado y haga clic en el link a continuación:

source: Deep Linking Launch - Configure tool
es_419: Herramienta de configuración para lanzamiento de Deep Linking

source: Press to Launch
es_419: Pulsar para iniciar

source: If you're seeing this on a live course, please contact the course staff.
es_419: Si usted está viendo esto en un curso en vivo, por favor contacte al equipo del curso.

source: Cancel
es_419: Cancelar

source: OK
es_419: Aceptar

source: Click OK to have your username and e-mail address sent to a 3rd party application.
es_419: Haz Clic en ACEPTAR para que tu nombre de usuario y correo electrónico sean enviados a una aplicación de 3ros.

source: Click OK to have your username sent to a 3rd party application.
es_419: Haz Clic en ACEPTAR para que su nombre de usuario sea enviado a una aplicación de 3ros.

source: Click OK to have your e-mail address sent to a 3rd party application.
es_419: Haz Clic en ACEPTAR para que tu correo electrónico sea enviado a una aplicación de 3ros.

source: Click Cancel to return to this page without sending your information.
es_419: Clic en CANCELAR para volver a está página sin que se que envíe su información.

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
ar: تعذر تحليل جواز مرورLTI : {lti_passport}. يجب أن يكون سلسلة "id:key:secret".
he: ניתוח LTI passport נכשל: {lti_passport}. צריך להיות במחרוזת "id:key:secret".

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
ar: تعذر تحليل العامل المخصص: {custom_parameter}. يجب أن يكون سلسلة "x=y".
he: ניתוח פרמטר מותאם אישית נכשל: {custom_parameter}. צריך להיות במחרוזת "x=y".
